result-regular-tp-4.txt
(vllm-spmd) hosseins@t1v-n-c8688aed-w-0:~/vllm-bench$ nohup vllm serve "meta-llama/Meta-Llama-3.1-8B" --download_dir /dev/shm --num-scheduler-steps 4 --swap-space 16 --disable-log-requests --tensor_parallel_size=4 --max-model-len=2048 --dtype=bfloat16 --gpu-memory-utilization=0.5 > output.log 2>&1 &

(vllm-bench) hosseins@t1v-n-c8688aed-w-0:~/vllm-bench$ python benchmarks/benchmark_serving.py \
    --backend vllm \    
    --model "meta-llama/Meta-Llama-3.1-8B"  \
    --dataset-name sharegpt \
    --dataset-path ~/data/ShareGPT_V3_unfiltered_cleaned_split.json  \
    --num-prompts 1000

Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|███████████████████████████████████████████████████████████████████████████████| 1000/1000 [00:32<00:00, 30.86it/s]
============ Serving Benchmark Result ============
Successful requests:                     1000      
Benchmark duration (s):                  36.46     
Total input tokens:                      215196    
Total generated tokens:                  128445    
Request throughput (req/s):              27.43     
Output token throughput (tok/s):         3523.09   
Total Token throughput (tok/s):          9425.66   
---------------Time to First Token----------------
Mean TTFT (ms):                          10747.10  
Median TTFT (ms):                        8760.71   
P99 TTFT (ms):                           25962.72  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          124.91    
Median TPOT (ms):                        60.86     
P99 TPOT (ms):                           1481.01   
---------------Inter-token Latency----------------
Mean ITL (ms):                           55.45     
Median ITL (ms):                         29.04     
P99 ITL (ms):                            310.14    
==================================================