result-spmd-tp4.txt
(vllm-bench-spmd) hosseins@t1v-n-c8688aed-w-0:~/vllm-bench-spmd$ nohup vllm serve "meta-llama/Meta-Llama-3.1-8B" --download_dir /dev/shm --num-scheduler-steps 4 --swap-space 16 --disable-log-requests --tensor_parallel_size=1 --max-model-len=2048 --dtype=bfloat16 --gpu-memory-utilization=0.5 > output.log 2>&1 &

(vllm-bench-spmd) hosseins@t1v-n-c8688aed-w-0:~/vllm-bench-spmd$ python benchmarks/benchmark_serving.py \
    --backend vllm \
    --model "meta-llama/Meta-Llama-3.1-8B"  \
    --dataset-name sharegpt \
    --dataset-path ~/data/ShareGPT_V3_unfiltered_cleaned_split.json  \
    --num-prompts 1000
    
============ Serving Benchmark Result ============
Successful requests:                     1000      
Benchmark duration (s):                  121.16    
Total input tokens:                      215196    
Total generated tokens:                  127626    
Request throughput (req/s):              8.25      
Output token throughput (tok/s):         1053.33   
Total Token throughput (tok/s):          2829.41   
---------------Time to First Token----------------
Mean TTFT (ms):                          33671.98  
Median TTFT (ms):                        25814.32  
P99 TTFT (ms):                           82695.58  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          415.45    
Median TPOT (ms):                        191.64    
P99 TPOT (ms):                           6616.59   
---------------Inter-token Latency----------------
Mean ITL (ms):                           177.12    
Median ITL (ms):                         72.96     
P99 ITL (ms):                            986.80    
==================================================